---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpotElevTextOrientation
source: html/392161e8-a38a-d00b-3439-44d3fb3fc1a3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpotElevTextOrientation Property

"Text Orientation"

## Syntax (C#)
```csharp
public static ForgeTypeId SpotElevTextOrientation { get; }
```